{"config": [{"config": {"activation": "relu", "bias_constraint": null, "filters": 64, "trainable": true, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 28, 28, 1], "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"activation": "relu", "bias_constraint": null, "filters": 64, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "rate": 0.25, "name": "dropout_1", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "bias_constraint": null, "filters": 128, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"activation": "relu", "bias_constraint": null, "filters": 128, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "rate": 0.25, "name": "dropout_2", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "bias_constraint": null, "filters": 128, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"activation": "relu", "bias_constraint": null, "filters": 128, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_6", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "rate": 0.25, "name": "dropout_3", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "bias_constraint": null, "filters": 256, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_7", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "units": 512, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_8", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"activation": "sigmoid", "trainable": true, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "units": 10, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.0", "class_name": "Sequential", "backend": "theano"}